Repository: dezet98/foederis
Catalog: lib/l10n/intl_*.arb
Languages: pl_pl

# login_screen_login
source: Log in
pl_pl: Zaloguj się

# login_screen_go_to_register
source: Create account
pl_pl: Załóż konto

# login_screen_visit_as_a_guest
source: Visit as a guest
pl_pl: Wejdź jako gość

# login_screen_email_placeholder
source: E-mail
pl_pl: Adres email

# login_screen_password_placeholder
source: Password
pl_pl: Hasło

# register_screen_register
source: Create
pl_pl: Utwórz

# register_screen_nav_bar_title
source: Create account
pl_pl: Zakładanie konta

# register_screen_email_placeholder
source: Pass your email
pl_pl: Podaj swój email

# register_screen_password_placeholder
source: Come up with a password
pl_pl: Wymyśl hasło

# app_bar_title_register
source: Create account
pl_pl: Tworzenie konta

# text_button_go_to_login
source: go to login
pl_pl: idź do logowania

source: settings
pl_pl: ustawienia

# home_screen_search_activities_tab_name
source: Search
pl_pl: Szukaj

# home_screen_search_activities_address_field_placeholder
source: Choose address
pl_pl: Wybierz adres

# home_screen_search_activities_no_results
source: No activity found, try to change the location or area of ​​search
pl_pl: Brak aktywności, spróbuj zmienić lokalizację bądź obszar poszukiwań

# home_screen_search_activities_error
source: Error while searching for activity
pl_pl: Błąd podczas wyszukiwania aktywności

# form_clear_button_text
source: clear
pl_pl: wyczyść

# home_screen_my_activity_tab_name
source: My activities
pl_pl: Moje aktywności

# home_screen_account_tab_name
source: Account
pl_pl: Konto

# filter_screen_nav_title
source: Filters
pl_pl: Filtry

# filter_screen_apply_button_text
source: Apply filters
pl_pl: Zastosuj filtry

# filters_screen_filter_subtitile_sort_by
source: Sort by name
pl_pl: Sortuj poprzez nazwę

# filters_screen_filter_value_desc
source: desc
pl_pl: malejąco

# filters_screen_filter_value_asc
source: asc
pl_pl: rosnąco

# filters_screen_filter_value_records_type
source: Type of records
pl_pl: Typ zapisów

# filters_screen_filter_value_free_join
source: free join records
pl_pl: wolne zapisy

# filters_screen_filter_value_with_appeal
source: for approval
pl_pl: do zatwierdzenia

# login_error_bad_credentials
source: Incorrect login or password
pl_pl: Nie poprawny login bądź hasło

# login_error_undefined
source: There was an unidentified login problem
pl_pl: Wystąpił niezidentyfikowany problem przy logowaniu

# register_error_undefined
source: There was an unidentified register problem
pl_pl: Wystąpił niezidentyfikowany problem przy rejestracji

# register_error_email_already_in_use
source: Given email is already taken
pl_pl: Podany email jest już zajęty

# register_error_invalid_email
source: Invalid email
pl_pl: Niepoprawny email

# register_error_email_weak_password
source: Weak password
pl_pl: Zbyt słabe hasło

# register_error_operation_not_allowed
source: Operation not allowed
pl_pl: Operacja niedozwolona

# guest_prohibited_access_info
source: To fully use the application, log in or create an account
pl_pl: Aby w pełni korzystać z aplikacji zaloguj się bądź załóż konto

# guest_prohibited_access_info_tab_content
source: To be able to create your own activities, view and participate in others, join us now!
pl_pl: Aby móc tworzyć własne aktywności, przeglądać i uczestniczyć w innych dołącz do nas już teraz!

# guest_prohibited_access_title
source: Access denied
pl_pl: Odmowa dostępu

# guest_prohibited_go_to_login
source: Log in
pl_pl: Zaloguj się

# guest_prohibited_go_to_register
source: Register
pl_pl: Zarejestruj

# activity_card_free_join
source: free join
pl_pl: wolny udział

# activity_card_registration
source: records
pl_pl: zapisy

# activity_card_complete
source: finish
pl_pl: ukończone

# activity_card_future
source: future
pl_pl: przyszłe

# fetching_error_info
source: Error when fetching data
pl_pl: Błąd pobierania danych

# plural_minutes
source: {howManyMinutes,plural, =1{{howManyMinutes} minute}=2{{howManyMinutes} minutes}other{{howManyMinutes} minutes}}
pl_pl: {howManyMinutes,plural, =1{{howManyMinutes} minuta}=2{{howManyMinutes} minuty}other{{howManyMinutes} minut}}

# plural_hours
source: {howManyHours,plural, =1{{howManyHours} hour}=2{{howManyHours} hours}other{{howManyHours} hours}}
pl_pl: {howManyHours,plural, =1{{howManyHours} godzina}=2{{howManyHours} godziny}other{{howManyHours} godzin}}

# plural_days
source: {howManyDays,plural, =1{{howManyDays} day}other{{howManyDays} days}}
pl_pl: {howManyDays,plural, =1{{howManyDays} dzień}other{{howManyDays} dni}}

# create_activity_screen_nav_bar_title
source: Create activity
pl_pl: Tworzenie aktywności

# create_activity_screen_apply_button_text
source: create
pl_pl: utwórz

# create_activity_screen_title_placeholder
source: title
pl_pl: tytuł

# create_activity_screen_title_label
source: Activity title
pl_pl: Tytuł aktywności

# create_activity_screen_free_join_label
source: No attendees approval
pl_pl: Bez zatwierdzania uczestników

# create_activity_screen_free_join_description
source: Without approval of participants, it will make everyone who signs up for the activity a participant. Otherwise, it can send a request to join which you must accept
pl_pl: Bez zatwierdzania uczestników sprawi że każdy kto zapiszę się na aktywność będzie już jej uczestnikiem. W przeciwnym razie może wysłąć prośbę o dołączenie którą ty musisz zaakceptować

# create_activity_screen_start_date_label
source: Start date
pl_pl: Data rozpoczęcia aktywności

# create_activity_screen_min_max_entry_label
source: A number of participants
pl_pl: Liczba uczestników

# create_activity_screen_min_max_entry_description
source: Determining the number of participants who can enroll in an activity without the required number of participants will be considered not completed.
pl_pl: Określenie liczby uczestników mogących się zapisać na aktywność, bez wymaganej liczby aktywność zostanie uznana za nie odbytą.

# create_activity_screen_category_label
source: Category
pl_pl: Kategoria

# create_activity_screen_address_label
source: Address
pl_pl: Adres

# create_activity_screen_address_description
source: Activity address, it is important to enter the correct address because users search for activity based on location
pl_pl: Adres aktywności, ważne by podać poprawny adres ponieważ użytkownicy wyszukują aktywności ze względu na lokalizację

# create_activity_screen_description_label
source: Description
pl_pl: Opis

# create_activity_screen_address_choose
source: choose location
pl_pl: wybierz adres

# update_user_form_nav_bar_title
source: Profile edition
pl_pl: Edycja profilu

# update_user_form_apply_button
source: submit
pl_pl: zatwierdź

# update_user_form_photo_label
source: Profile photo
pl_pl: Zdjęcie profilowe

# update_user_form_first_name_label
source: Name
pl_pl: Imię

# update_user_form_second_name_label
source: Surname
pl_pl: Nazwisko

# update_user_form_about_label
source: About
pl_pl: O sobie

# update_user_form_phone_label
source: Phone
pl_pl: Telefon

# update_user_form_birthday_label
source: Birthday
pl_pl: Data urodzin

# update_user_form_gender_label
source: Gender
pl_pl: Płeć

# stepper_next_button_text
source: next
pl_pl: dalej

# stepper_cancel_button_text
source: cancel
pl_pl: wróć

# form_field_info_dialog_title
source: Details for the field {validatorName}
pl_pl: Szczegóły dla pola {validatorName}

# form_field_info_digits_validator
source: value must be an integer
pl_pl: wartość musi być liczbą całkowitą

# form_field_info_numbers_range_validator
source: the length of a given expression should be within the range <{min}, {max}>
pl_pl: wartość musi znajdować się w przedziale <{min}, {max}>

# form_field_info_date_time_range_validator
source: date must be before {minDate} and after {maxDate}
pl_pl: data musi być przed {minDate} a po {maxDate}

# form_field_info_not_null_validator
source: mandatory field
pl_pl: musisz wypełnić to pole

# form_field_info_phone_validator
source: phone number must be in the form xxx xxx xxx
pl_pl: numer telefonu musi być w postaci xxx xxx xxx

# form_field_info_numbers_validator
source: the condition must be met: value1 {character} value2
pl_pl: musi być spełniony warunek: wartość1 {znak} wartość2

# form_field_info_additional_info
source: description
pl_pl: opis

# form_field_info_additional_validation
source: validation
pl_pl: walidacja

# date_time_picker_text
source: choose date
pl_pl: wybierz datę

# category_football
source: football
pl_pl: piłka nożna

# category_beer
source: beer
pl_pl: piwo

# gender_male
source: man
pl_pl: męszczyzna

# gender_female
source: female
pl_pl: kobieta

# gender_prefer_not_to_say
source: prefere not to say
pl_pl: wolę nie mówić

# form_field_photo_choose_photo
source: choose photo
pl_pl: wybierz zdjęcie

# localization_en_US
source: english(USA)
pl_pl: angielski(USA)

# localization_pl_PL
source: polish(Poland)
pl_pl: polski(Polska)

# home_screen_settings_tab_log_out
source: log out
pl_pl: wyloguj się

# home_screen_settings_tab_change_language
source: language:
pl_pl: zmiana języka:

# search_area_form_nav_bar_title
source: Search area
pl_pl: Zakres poszukiwań

# search_area_form_apply_text
source: search
pl_pl: szukaj

# search_area_form_distance_label
source: Distance
pl_pl: Dystans

# search_area_form_distance_description
source: The search range determines the radius from which activities will be searched from the point of the previously selected address
pl_pl: Zakres poszukiwań określa promień od jakiego będą szukane aktywności od punktu wybranego wcześniej adresu

# activity_role_maker
source: maker
pl_pl: założyciel

# activity_role_coorganizator
source: co-organizer
pl_pl: wspołorganizator

# activity_role_attendee
source: attendee
pl_pl: uczestnik

# snackbar_form_send_error
source: Error sending the form
pl_pl: Błąd przy wysyłaniu formularza

# snackbar_create_activity_form_send_error
source: Error creating activity
pl_pl: Błąd przy tworzeniu aktywności

# snackbar_create_activity_form_send_success
source: The activity was created successfully
pl_pl: Aktywność została utworzona pomyślnie

# snackbar_form_send_error_success
source: Success in submitting the form
pl_pl: Sukces wysyłania formularza

# activity_details_screen_attendee_tab_nav_bar_title
source: Attendees
pl_pl: Uczestnicy

# activity_details_screen_attendee_tab_grant_organizator_grants
source: Give co-organizer rights
pl_pl: Nadaj prawa organizatora

# activity_details_screen_attendee_tab_give_organizator_rights_up
source: Take away the rights of the co-organizer
pl_pl: Odbierz prawa organizatora

# activity_details_screen_attendee_tab_join_date
source: date of joining:
pl_pl: data dołączenia:

# activity_details_screen_attendee_tab_role
source: role:
pl_pl: rola:

# activity_details_screen_map_tab_nav_bar_title
source: Map
pl_pl: Mapa

# activity_details_screen_details_tab_nav_bar_title
source: Details
pl_pl: Szczegóły

# activity_details_screen_details_tab_records_label
source: The nature of the records
pl_pl: Charakter zapisów

# activity_details_screen_details_tab_records_free_join
source: free
pl_pl: wolne

# activity_details_screen_details_tab_records_with_appeal
source: requiring approval
pl_pl: wymagające akceptacji organizatora

# activity_details_screen_details_tab_address
source: Address
pl_pl: Adres

# activity_details_screen_details_tab_attendees_label
source: Number of attendees
pl_pl: Ilość uczestników

# activity_details_screen_details_tab_attendees_range_label
source: Possible number of attendees
pl_pl: Możliwa ilość uczestników

# activity_details_screen_details_tab_attendees_range
source: From {min} to {max}
pl_pl: Od {min} do {max}

# activity_details_screen_details_tab_description
source: About activity
pl_pl: Opis aktywności

# activity_details_screen_details_tab_status
source: Status
pl_pl: Status aktywności

# activity_details_screen_details_tab_start_date
source: Start date
pl_pl: Data rozpoczęcia

# activity_details_screen_details_tab_category
source: Category
pl_pl: Kategoria

# activity_details_screen_free_join_tab_nav_bar_title
source: Records
pl_pl: Zapisy

# activity_details_screen_free_join_tab_join_button
source: Join to activity
pl_pl: Dołącz do aktywności

# activity_details_screen_requests_tab_join_title
source: Requests to join
pl_pl: Prośby o dołączenie

# activity_details_screen_requests_tab_accept_request
source: accept
pl_pl: akceptuj prośbę o dołączenie

# activity_details_screen_records_cancel_request
source: cancel the request to join
pl_pl: anuluj prośbę o dołączenie

# activity_details_screen_records_nav_bar_tab
source: Records
pl_pl: Zapisy

# activity_details_screen_records_send_appeal
source: ask to join the activity
pl_pl: wyślij prośbę o dołączenie do aktywności

# activity_details_screen_records_cancel_info
source: Your request is awaiting the decision of the organizer
pl_pl: Twoja prośba oczekuje na decyzję organizatora

# activity_details_screen_request_tab_no_results
source: No requests to join the activity
pl_pl: Brak próśb o dołączenie do aktywności

# appeal_join_form_comment_label
source: Message
pl_pl: Wiadomość

# appeal_join_form_comment_placeholder
source: Comment to request
pl_pl: Komentarz do prośby

# activity_details_screen_cancel_activity_button_text
source: cancel activity
pl_pl: anuluj aktywność

# activity_details_screen_cancel_involvement_button_text
source: cancel participation in the activity
pl_pl: anuluj udział w aktywności

# activity_cancel_status
source: canceled
pl_pl: odwołana

# activity_open_status
source: during registration
pl_pl: w trakcie zapisów

# activity_finish_status
source: finished
pl_pl: zakończona

# activity_no_places_status
source: no places
pl_pl: brak miejsc

# user_profile_screen_basic_info_tab
source: Profile
pl_pl: Profil

# user_profile_screen_basic_info_first_name
source: Name
pl_pl: Imię

# user_profile_screen_basic_info_second_name
source: Surname
pl_pl: Nazwisko

# user_profile_screen_basic_info_about
source: About me
pl_pl: O mnie

# user_profile_screen_basic_info_gender
source: Gender
pl_pl: Płeć

# user_profile_screen_basic_info_age
source: Age
pl_pl: Wiek

# user_profile_screen_basic_info_phone
source: Phone
pl_pl: Telefon

# user_profile_screen_statistics_nav_bar_title
source: Statistics
pl_pl: Statystyki

# user_profile_screen_statistics_as_maker
source: Own activities:
pl_pl: Własnych aktywności:

# user_profile_screen_statistics_as_coorganizer
source: Activities as a co-organizerr:
pl_pl: Aktywności jako koorganizator:

# user_profile_screen_statistics_as_attendee
source: Activities as a participant:
pl_pl: Aktywności jako uczestnik:

# user_profile_screen_statistics_cancel_involvement
source: Amount of canceled participation in activities:
pl_pl: Ilość anulowanego uczestnistwa w aktywnościach:
